HelpMessage = 'Всегда рады вам помочь! Заходите: https://t.me/smoservice_bot'
FAQText = '❓ Как быстро запустится заказ?\n' \
          '❕ Мгновенно\n' \
          '\n' \
          '❓ Не забанят ли меня?\n' \
          '❕ Нет\n' \
          '\n' \
          '❓ Как работает сервис, каким образом выполняются заказы?\n' \
          '❕ Мы предлагаем вам подписчиков как из CPA сетей, так и подписчиков с рекламы, ' \
          'привлеченных через социальные сети. ' \
          'Подписчики CPA добавляются в группу или подписываются на страницу за вознаграждение. ' \
          'Что такое CPA, можете почитать у нас на сайте в информационном разделе вопросов и ответов. ' \
          'Наш сервис старается работать только с качественными ' \
          'источниками и использовать только лучшие из возможных методов для выполнения каждого заказа.\n'
TextAddCheck = '🧾<b>Чеки</b>\n' \
               '\n' \
               'Чеки позволяют отправлять деньги прямо в \n' \
               'сообщениях.\n' \
               '\n' \
               '· Персональный чек - для отправки монет одному пользователю\n' \
               '· Мульти-чек - для отправки монет нескольким пользователям и \n' \
               'добавить условие подписки\n' \
               '\n' \
               '<b>Выберите тип чека:</b>'
TextPersonalCheck = '🧾<b>Персональные чеки</b>\n' \
                    '\n' \
                    'Создайте персональный чек, чтобы отправить сообщение с \n' \
                    'монетами выбранному Вами пользователю.'
TextAddMultiCheck = '🧾<b>Мульти-чеки</b>\n' \
                    '\n' \
                    'Создайте Мульти-чек, чтобы раздать деньги нескольким\n' \
                    'пользователям, например в чате или канале.\n' \
                    '\n' \
                    'Можно добавить условие подписки на канал/чат.'

